using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace ArtTherapy.BussinesLogic
{
    public static class MainResult
    {
        public static List<List<Result>> Results = new List<List<Result>>();

        static MainResult()
        {
            List<Result> Choleric = new List<Result>();
            Choleric.Add(new Result("Холерик", "Стрес", "Експресіонзім", "Акварель", "За результатами тесту ваш темперамент Холерик, і ви знаходитесь в Стресовому стані. Ідеальна арт - терапія для вас: Акварель", "Так як, ваш темперамент: Холерик, вас може зацікавити напрям Експресеонізма в мистецтві", "Акварель", Properties.Resources.Logo));
            Choleric.Add(new Result("Холерик", "Емоційний", "Експресіонзім", "Рідкий Акрил", "За результатами тесту ваш темперамент Холерик, і ви знаходитесь в Емоційному стані. Ідеальна арт - терапія для вас: Рідкий Акрил", "Так як, ваш темперамент: Холерик, вас може зацікавити напрям Експресеонізма в мистецтві", "Рідкий Акрил", Properties.Resources.Logo));
            Choleric.Add(new Result("Холерик", "Спокіниий", "Експресіонзім", "Акрил", "За результатами тесту ваш темперамент Холерик, і ви знаходитесь в Спокійному стані. Ідеальна арт - терапія для вас: Акрил", "Так як, ваш темперамент: Холерик, вас може зацікавити напрям Експресеонізма в мистецтві", "Акрил", Properties.Resources.Logo));
            List<Result> Sanguine = new List<Result>();
            Sanguine.Add(new Result("Сангвінік", "Стрес", "Сюрреалізм", "Скульптура", "За результатами тесту ваш темперамент Сангвінік, і ви знаходитесь в Стресовому стані. Ідеальна арт - терапія для вас: Скульптура", "Так як, ваш темперамент: Сангвінік, вас може зацікавити напрям Сюрреалізму в мистецтві", "Скульптура", Properties.Resources.Logo));
            Sanguine.Add(new Result("Сангвінік", "Емоційний", "Сюрреалізм", "Пастель", "За результатами тесту ваш темперамент Сангвінік, і ви знаходитесь в Емоційному стані. Ідеальна арт - терапія для вас: Пастель", "Так як, ваш темперамент: Сангвінік, вас може зацікавити напрям Сюрреалізму в мистецтві", "Пастель", Properties.Resources.Logo));
            Sanguine.Add(new Result("Сангвінік", "Спокіниий", "Сюрреалізм", "Графіка", "За результатами тесту ваш темперамент Сангвінік, і ви знаходитесь в Спокійному стані. Ідеальна арт - терапія для вас: Графіка", "Так як, ваш темперамент: Сангвінік, вас може зацікавити напрям Сюрреалізму в мистецтві", "Графіка", Properties.Resources.Logo));
            List<Result> Phlegmatic = new List<Result>();
            Phlegmatic.Add(new Result("Флегматик", "Стрес", "Кубізм", "Колаж", "За результатами тесту ваш темперамент Флегматик, і ви знаходитесь в Стресовому стані. Ідеальна арт - терапія для вас: Колаж", "Так як, ваш темперамент: Флегматик, вас може зацікавити напрям Кубізму в мистецтві", "Колаж", Properties.Resources.Logo));
            Phlegmatic.Add(new Result("Флегматик", "Емоційний", "Кубізм", "Гротаж", "За результатами тесту ваш темперамент Флегматик, і ви знаходитесь в Емоційному стані. Ідеальна арт - терапія для вас: Гротаж", "Так як, ваш темперамент: Флегматик, вас може зацікавити напрям Кубізму в мистецтві", "Гротаж", Properties.Resources.Logo));
            Phlegmatic.Add(new Result("Флегматик", "Спокіниий", "Кубізм", "Олія", "За результатами тесту ваш темперамент Флегматик, і ви знаходитесь в Спокійному стані. Ідеальна арт - терапія для вас: Олія", "Так як, ваш темперамент: Флегматик, вас може зацікавити напрям Кубізму в мистецтві", "Олія", Properties.Resources.Logo));
            // Спросить юлю про олію
            List<Result> Melanholic = new List<Result>();
            Melanholic.Add(new Result("Меланхолік", "Стрес", "Символізм", "Вишивання", "За результатами тесту ваш темперамент Меланхолік, і ви знаходитесь в Стресовому стані. Ідеальна арт - терапія для вас: Вишивання", "Так як, ваш темперамент: Меланхолік, вас може зацікавити напрям Символізму в мистецтві", "Вишивання", Properties.Resources.Logo));
            Melanholic.Add(new Result("Меланхолік", "Емоційний", "Символізм", "Розспис", "За результатами тесту ваш темперамент Меланхолік, і ви знаходитесь в Емоційному стані. Ідеальна арт - терапія для вас: Розспис", "Так як, ваш темперамент: Меланхолік, вас може зацікавити напрям Символізму в мистецтві", "Розпис", Properties.Resources.Logo));
            Melanholic.Add(new Result("Меланхолік", "Спокіниий", "Символізм", "Каліграфія", "За результатами тесту ваш темперамент Меланхолік, і ви знаходитесь в Спокійному стані. Ідеальна арт - терапія для вас: Каліграфія", "Так як, ваш темперамент: Меланхолік, вас може зацікавити напрям Символізму в мистецтві", "Каліграфія", Properties.Resources.Logo));
            Results.Add(Choleric);
            Results.Add(Sanguine);
            Results.Add(Phlegmatic);
            Results.Add(Melanholic);
        }
    }
}
