using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace ArtTherapy.BussinesLogic
{
    public static class MainQuestions
    {
        public static List<QuestionPart1> Questions1 = new List<QuestionPart1>();
        public static List<QuestionPart2> Questions2 = new List<QuestionPart2>();
        public static QuestionPart1 Part1ControlQuestion = new QuestionPart1("Ваш процес звикання до нового середовища:", "Страх перед новим, небажання змін, довга адаптація", "Довгий процес звикання, непроста адаптація", "Швидке звикання до нового середовища, іноді виникають складності притримування нових вимог", "Полюбляю нові можливості, як правило адаптація легка і швидка ");
        public static QuestionPart2 Part2ControlQuestion = new QuestionPart2("Як ви можете описати своє самопочуття?", "Мені здається, що я на межі. Я не почуваю себе добре", "В деякі дні я почуваю себе дуже добре, а в інші зовсім не маю сил", "Добре. Іноді я почуваю втомленість, але після відпочинку я прихожу до тями");

        static MainQuestions()
        {
            Questions1.Add(new QuestionPart1("Якими характеристиками вас можна описати?", "Cпокійний, приземлений, стриманий, миролюбний.", "Вразливий, сором'язливий, уразливий, нерішучий.", "Енергійний, невгамовний, пустотливий, гарячий, задерикуватий.", "Життєлюбний, оптимістичний, товариський, ризикуючий."));
            Questions1.Add(new QuestionPart1("Які емоції ви відчуваєте найчастіше та наяскравіше?", "Позитивні, але бурхливих реакцій немає.", "Сумніви, іноді страх.", "Роздратування, бурхливі емоції.", "Позитивні емоції, багато посміхаюся."));
            Questions1.Add(new QuestionPart1("Які види активності вам більше до вподоби?", "Тихі, спокійні, одиночні", "Якщо я на самоті то спокійні, а з близькими – активні та динамічні", "Азартні, рухливі, динамічні", "Не важливо, головне – щоб було весело"));
            Questions1.Add(new QuestionPart1("Як ви реагуєте на критику?", "Практично без емоцій", "Негативно, зазвичай мені неприємно та образливо", "На конструктивну - спокійно, на іншу - з бурхливим протестом", "Спокійно – це можливість стати краще"));
            Questions1.Add(new QuestionPart1("Як ведете себе в несподіваних ситуаціях?", "Мене складно здивувати, тож малоемоційно", "Намагаюся уникнути цієї ситуації", "Намагаюся чинити опір і бути готовим незважаючи ні на що", "Виявляю цікавість щодо ситуації"));
            Questions1.Add(new QuestionPart1("Наскільки ви товариська людина?", "Віддаю перевагу самотності", "Віддаю перевагу самотності, але з близькими людьми почуваю себе добре.", "Потребую багато спілкування і уваги.", "Швидко знаходжу спільну мову з усіма, люблю нові знайомства."));
            Questions1.Add(new QuestionPart1("Яке становище ви займаєте в своєму колі спілкування? Чи маєте ви лідерські якості?", "Як правило визнаю лідерами інших людей", "Я не вважаю себе лідером, але до мене зазвичай прислухаються мої друзі", "Я вважаю себе гарним лідером, зазвичай сам себе висуваю на цю посаду", "Я душа компанії та визнаю в собі лідерські якості"));
            Questions1.Add(new QuestionPart1("Як би ви описали властивості своєї памяті?", "Запам'ятовую повільно, але запам'ятовую і майже не забуваю", "Запам'ятовую по-різному, частіше вникаю в дрібниці", "Як правило швидко запам'ятовую деталі, але швидко забуваю", "Швидко і легко схоплюю все і довго пам'ятаю"));
            Questions1.Add(new QuestionPart1("Як ви засвоюєте нову інформацію?", "Повільно, зате розсудливо", "Залежить від обставин", "Схоплюю на льоту, але швидко забуваю", "Швидко і легко"));
            Questions1.Add(new QuestionPart1("Ваша втомлюваність:", "Дуже низька, я майже не втомлююся", "Висока, будь-яка діяльність викликає занепад сил", "Іноді середня, іноді висока, залежить від моїх емоцій", "Середня, як правило втомлююся пропорційно своїй діяльності"));
            Questions1.Add(new QuestionPart1("Як ви можете описати вашу мову?", "Мова повільна, невиразна, зазвичай без жестів", "Мова тиха і невпевнена, але виразна", "Мова емоційна, швидка, іноді переходить на підвищені тони", "Мова виразна, жива, з жестами та мімікою"));
            Questions1.Add(new QuestionPart1("Опишіть як ви рухаєтесь", "Впевнено, неквапливо, нерозторопно", "Метушливо, неточно, невпевнено", "Різко, рвучко, енергійно", "Ритмічно, точно, впевнено"));
            Questions1.Add(new QuestionPart1("Особливості сну:", "Засинаю швидко, сплю спокійно, після сну відчуваю себе мляво.", "Довго не можу заставити себе лягти спати, але засинаю швидко, після сну відчуваю себе добре", "Засинаю довго і важко, сон неспокійний, після сну стан може бути різним: спокійним або схвильованим.", "Засинаю швидко, сон міцний, після сну почуваю себе добре"));

            Questions2.Add(new QuestionPart2("Ви часто відчуваєте постійну тривожність без причин останнім часом? Як це впливає на вас?", "В голові тисячі думок, справ та проблем. Відчуваю страх та невпевненість.", "Буває, але нічого особливого… Не варто через це турбуватись.", "Не відчуваю тривоги без причин"));
            Questions2.Add(new QuestionPart2("Ви ділитеся своїми переживаннями з іншими людьми?", "Я намагаюся, але, іноді мені здається у кожного купа своїх проблем", "Іноді можу розговоритися про особисте навіть з малознайомими людьми, але деякі речі все ж тримаю в собі", "Так, сім'я і друзі підтримують мене"));
            Questions2.Add(new QuestionPart2("Вас легко вивести із себе?", "Так, іноді навіть без серйозної на те причини", "Іноді зриваюся, але зазвичай я здатний підтримувати розмову адекватно", "Ні, треба сильно постаратися"));
            Questions2.Add(new QuestionPart2("Ви відчуваєте себе так, начебто вам не вистачає часу все встингути?", "Постійно, мені недостатньо 24 годин у добі", "Я б хотів/ла встигати більше ніж зараз, мені здається що я витрачаю енергію на менш важливі речі", "Ні, якщо мені буде потрібно, я можу встигнути зробити все що необхідно"));
            Questions2.Add(new QuestionPart2("Коли ви лягаєте спати, які вам приходять думки?", "Я думаю про те, що у мене в планах на наступні дні", "Зазвичай я вигадую яскраві сценарії у моїй голові перед сном", "Як правило, я не пам’ятаю про що думаю перед тим як заснути"));
        }
    }
}
